program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1429.0.0"}})]
{
    func main<ios16>(tensor<fp16, [2, 768, 1, 77]> encoder_hidden_states, tensor<fp16, [2, 4, 64, 64]> sample, tensor<fp16, [2]> timestep) {
            tensor<int32, []> var_25 = const()[name = tensor<string, []>("op_25"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_42_axes_0 = const()[name = tensor<string, []>("op_42_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1]> var_42_cast = expand_dims(axes = var_42_axes_0, x = timestep);
            tensor<fp16, [1, 160]> var_44_to_fp16 = const()[name = tensor<string, []>("op_44_to_fp16"), val = tensor<fp16, [1, 160]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [2, 160]> emb_3_cast = mul(x = var_42_cast, y = var_44_to_fp16);
            tensor<fp16, [2, 160]> var_49_cast = sin(x = emb_3_cast);
            tensor<fp16, [2, 160]> var_50_cast = cos(x = emb_3_cast);
            tensor<bool, []> emb_interleave_0 = const()[name = tensor<string, []>("emb_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> emb_cast = concat(axis = var_25, interleave = emb_interleave_0, values = (var_49_cast, var_50_cast));
            tensor<int32, [2]> var_54_begin_0 = const()[name = tensor<string, []>("op_54_begin_0"), val = tensor<int32, [2]>([0, 160])];
            tensor<int32, [2]> var_54_end_0 = const()[name = tensor<string, []>("op_54_end_0"), val = tensor<int32, [2]>([2, 320])];
            tensor<bool, [2]> var_54_end_mask_0 = const()[name = tensor<string, []>("op_54_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [2, 160]> var_54_cast = slice_by_index(begin = var_54_begin_0, end = var_54_end_0, end_mask = var_54_end_mask_0, x = emb_cast);
            tensor<int32, [2]> var_56_begin_0 = const()[name = tensor<string, []>("op_56_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_56_end_0 = const()[name = tensor<string, []>("op_56_end_0"), val = tensor<int32, [2]>([2, 160])];
            tensor<bool, [2]> var_56_end_mask_0 = const()[name = tensor<string, []>("op_56_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [2, 160]> var_56_cast = slice_by_index(begin = var_56_begin_0, end = var_56_end_0, end_mask = var_56_end_mask_0, x = emb_cast);
            tensor<bool, []> sample_interleave_0 = const()[name = tensor<string, []>("sample_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> sample_cast = concat(axis = var_25, interleave = sample_interleave_0, values = (var_54_cast, var_56_cast));
            tensor<int32, []> var_59 = const()[name = tensor<string, []>("op_59"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_66_axes_0 = const()[name = tensor<string, []>("op_66_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1]> var_66_cast = expand_dims(axes = var_66_axes_0, x = sample_cast);
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1, 1]> input_1_cast = expand_dims(axes = input_1_axes_0, x = var_66_cast);
            tensor<int32, [2]> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 320, 1, 1]> time_embedding_linear_1_weight_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_weight_to_fp16"), val = tensor<fp16, [1280, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(448)))];
            tensor<fp16, [1280]> time_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(819712)))];
            tensor<fp16, [2, 1280, 1, 1]> input_3_cast = conv(bias = time_embedding_linear_1_bias_to_fp16, dilations = var_72, groups = var_59, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_70, weight = time_embedding_linear_1_weight_to_fp16, x = input_1_cast);
            tensor<fp16, [2, 1280, 1, 1]> input_5_cast = silu(x = input_3_cast);
            tensor<int32, [2]> var_78 = const()[name = tensor<string, []>("op_78"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> time_embedding_linear_2_weight_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(822336)))];
            tensor<fp16, [1280]> time_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4099200)))];
            tensor<fp16, [2, 1280, 1, 1]> input_13_cast = conv(bias = time_embedding_linear_2_bias_to_fp16, dilations = var_80, groups = var_59, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_78, weight = time_embedding_linear_2_weight_to_fp16, x = input_5_cast);
            tensor<int32, []> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_91 = const()[name = tensor<string, []>("op_91"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 4, 3, 3]> conv_in_weight_to_fp16 = const()[name = tensor<string, []>("conv_in_weight_to_fp16"), val = tensor<fp16, [320, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4101824)))];
            tensor<fp16, [320]> conv_in_bias_to_fp16 = const()[name = tensor<string, []>("conv_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4124928)))];
            tensor<fp16, [2, 320, 64, 64]> input_7_cast_1 = conv(bias = conv_in_bias_to_fp16, dilations = var_91, groups = var_86, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_89, weight = conv_in_weight_to_fp16, x = sample);
            tensor<bool, []> var_110 = const()[name = tensor<string, []>("op_110"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_115 = const()[name = tensor<string, []>("op_115"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_7_cast_1);
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> square_0_cast = square(x = sub_0_cast);
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast);
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast);
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast);
            tensor<fp16, [320]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4125632)))];
            tensor<fp16, [320]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4126336)))];
            tensor<fp16, [320]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4127040)))];
            tensor<fp16, [320]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4127744)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast);
            tensor<fp16, [2, 320, 64, 64]> input_11_cast = silu(x = add_1_cast);
            tensor<int32, [2]> var_137 = const()[name = tensor<string, []>("op_137"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_139 = const()[name = tensor<string, []>("op_139"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4128448)))];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5971712)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_1_cast = conv(bias = down_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_139, groups = var_115, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_137, weight = down_blocks_0_resnets_0_conv1_weight_to_fp16, x = input_11_cast);
            tensor<fp16, [2, 1280, 1, 1]> input_15_cast_1 = silu(x = input_13_cast);
            tensor<int32, [2]> var_145 = const()[name = tensor<string, []>("op_145"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_147 = const()[name = tensor<string, []>("op_147"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_1_pad_type_0 = const()[name = tensor<string, []>("temb_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_1_pad_0 = const()[name = tensor<string, []>("temb_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1280, 1, 1]> down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [320, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5972416)))];
            tensor<fp16, [320]> down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6791680)))];
            tensor<fp16, [2, 320, 1, 1]> temb_1_cast = conv(bias = down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_147, groups = var_115, pad = temb_1_pad_0, pad_type = temb_1_pad_type_0, strides = var_145, weight = down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16, x = input_15_cast_1);
            tensor<fp16, [2, 320, 64, 64]> input_17_cast = add(x = hidden_states_1_cast, y = temb_1_cast);
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_17_cast);
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> square_1_cast = square(x = sub_2_cast);
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast);
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast);
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast);
            tensor<fp16, [320]> add_3_mean_0_to_fp16 = const()[name = tensor<string, []>("add_3_mean_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6792384)))];
            tensor<fp16, [320]> add_3_variance_0_to_fp16 = const()[name = tensor<string, []>("add_3_variance_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6793088)))];
            tensor<fp16, [320]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6793792)))];
            tensor<fp16, [320]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6794496)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_3_mean_0_to_fp16, variance = add_3_variance_0_to_fp16, x = reshape_5_cast);
            tensor<fp16, [2, 320, 64, 64]> input_21_cast = silu(x = add_3_cast);
            tensor<int32, [2]> var_157 = const()[name = tensor<string, []>("op_157"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6795200)))];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8638464)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_3_cast = conv(bias = down_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_159, groups = var_115, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_157, weight = down_blocks_0_resnets_0_conv2_weight_to_fp16, x = input_21_cast);
            tensor<fp16, [2, 320, 64, 64]> hidden_states_5_cast = add(x = input_7_cast_1, y = hidden_states_3_cast);
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = hidden_states_5_cast);
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> square_2_cast = square(x = sub_4_cast);
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast);
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast);
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast);
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast);
            tensor<fp16, [320]> add_5_mean_0_to_fp16 = const()[name = tensor<string, []>("add_5_mean_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8639168)))];
            tensor<fp16, [320]> add_5_variance_0_to_fp16 = const()[name = tensor<string, []>("add_5_variance_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8639872)))];
            tensor<fp16, [320]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8640576)))];
            tensor<fp16, [320]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8641280)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_5_mean_0_to_fp16, variance = add_5_variance_0_to_fp16, x = reshape_9_cast);
            tensor<int32, [2]> var_179 = const()[name = tensor<string, []>("op_179"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_7_pad_type_0 = const()[name = tensor<string, []>("hidden_states_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_proj_in_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_proj_in_weight_to_fp16"), val = tensor<fp16, [320, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8641984)))];
            tensor<fp16, [320]> down_blocks_0_attentions_0_proj_in_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_proj_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8846848)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_7_cast = conv(bias = down_blocks_0_attentions_0_proj_in_bias_to_fp16, dilations = var_181, groups = var_115, pad = hidden_states_7_pad_0, pad_type = hidden_states_7_pad_type_0, strides = var_179, weight = down_blocks_0_attentions_0_proj_in_weight_to_fp16, x = add_5_cast);
            tensor<int32, [4]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [4]>([2, 320, 1, 4096])];
            tensor<fp16, [2, 320, 1, 4096]> inputs_1_cast = reshape(shape = var_186, x = hidden_states_7_cast);
            tensor<int32, [1]> var_196 = const()[name = tensor<string, []>("op_196"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> channels_mean_1_cast = reduce_mean(axes = var_196, keep_dims = var_110, x = inputs_1_cast);
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_1_cast = sub(x = inputs_1_cast, y = channels_mean_1_cast);
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_sq_1_cast = mul(x = zero_mean_1_cast, y = zero_mean_1_cast);
            tensor<int32, [1]> var_200 = const()[name = tensor<string, []>("op_200"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> var_201_cast = reduce_mean(axes = var_200, keep_dims = var_110, x = zero_mean_sq_1_cast);
            tensor<fp16, []> var_202_to_fp16 = const()[name = tensor<string, []>("op_202_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1, 1, 4096]> var_203_cast = add(x = var_201_cast, y = var_202_to_fp16);
            tensor<fp16, []> denom_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [2, 1, 1, 4096]> denom_1_cast = rsqrt(epsilon = denom_1_epsilon_0_to_fp16, x = var_203_cast);
            tensor<fp16, [2, 320, 1, 4096]> out_1_cast = mul(x = zero_mean_1_cast, y = denom_1_cast);
            tensor<fp16, [1, 320, 1, 1]> var_207_to_fp16 = const()[name = tensor<string, []>("op_207_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8847552)))];
            tensor<fp16, [2, 320, 1, 4096]> var_208_cast = add(x = out_1_cast, y = var_207_to_fp16);
            tensor<fp16, [1, 320, 1, 1]> var_210_to_fp16 = const()[name = tensor<string, []>("op_210_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8848256)))];
            tensor<fp16, [2, 320, 1, 4096]> hidden_states_9_cast = mul(x = var_208_cast, y = var_210_to_fp16);
            tensor<int32, [2]> var_217 = const()[name = tensor<string, []>("op_217"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_219 = const()[name = tensor<string, []>("op_219"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16"), val = tensor<fp16, [320, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8848960)))];
            tensor<fp16, [2, 320, 1, 4096]> q_1_cast = conv(dilations = var_219, groups = var_115, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = var_217, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16, x = hidden_states_9_cast);
            tensor<int32, [2]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_225 = const()[name = tensor<string, []>("op_225"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16"), val = tensor<fp16, [320, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9053824)))];
            tensor<fp16, [2, 320, 1, 4096]> k_1_cast = conv(dilations = var_225, groups = var_115, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = var_223, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16, x = hidden_states_9_cast);
            tensor<int32, [2]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_1_pad_type_0 = const()[name = tensor<string, []>("v_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_1_pad_0 = const()[name = tensor<string, []>("v_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16"), val = tensor<fp16, [320, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9258688)))];
            tensor<fp16, [2, 320, 1, 4096]> v_1_cast = conv(dilations = var_231, groups = var_115, pad = v_1_pad_0, pad_type = v_1_pad_type_0, strides = var_229, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16, x = hidden_states_9_cast);
            tensor<int32, [4]> var_235_begin_0 = const()[name = tensor<string, []>("op_235_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_235_end_0 = const()[name = tensor<string, []>("op_235_end_0"), val = tensor<int32, [4]>([2, 40, 1, 4096])];
            tensor<bool, [4]> var_235_end_mask_0 = const()[name = tensor<string, []>("op_235_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_235_cast = slice_by_index(begin = var_235_begin_0, end = var_235_end_0, end_mask = var_235_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_239_begin_0 = const()[name = tensor<string, []>("op_239_begin_0"), val = tensor<int32, [4]>([0, 40, 0, 0])];
            tensor<int32, [4]> var_239_end_0 = const()[name = tensor<string, []>("op_239_end_0"), val = tensor<int32, [4]>([2, 80, 1, 4096])];
            tensor<bool, [4]> var_239_end_mask_0 = const()[name = tensor<string, []>("op_239_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_239_cast = slice_by_index(begin = var_239_begin_0, end = var_239_end_0, end_mask = var_239_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_243_begin_0 = const()[name = tensor<string, []>("op_243_begin_0"), val = tensor<int32, [4]>([0, 80, 0, 0])];
            tensor<int32, [4]> var_243_end_0 = const()[name = tensor<string, []>("op_243_end_0"), val = tensor<int32, [4]>([2, 120, 1, 4096])];
            tensor<bool, [4]> var_243_end_mask_0 = const()[name = tensor<string, []>("op_243_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_243_cast = slice_by_index(begin = var_243_begin_0, end = var_243_end_0, end_mask = var_243_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_247_begin_0 = const()[name = tensor<string, []>("op_247_begin_0"), val = tensor<int32, [4]>([0, 120, 0, 0])];
            tensor<int32, [4]> var_247_end_0 = const()[name = tensor<string, []>("op_247_end_0"), val = tensor<int32, [4]>([2, 160, 1, 4096])];
            tensor<bool, [4]> var_247_end_mask_0 = const()[name = tensor<string, []>("op_247_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_247_cast = slice_by_index(begin = var_247_begin_0, end = var_247_end_0, end_mask = var_247_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_251_begin_0 = const()[name = tensor<string, []>("op_251_begin_0"), val = tensor<int32, [4]>([0, 160, 0, 0])];
            tensor<int32, [4]> var_251_end_0 = const()[name = tensor<string, []>("op_251_end_0"), val = tensor<int32, [4]>([2, 200, 1, 4096])];
            tensor<bool, [4]> var_251_end_mask_0 = const()[name = tensor<string, []>("op_251_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_251_cast = slice_by_index(begin = var_251_begin_0, end = var_251_end_0, end_mask = var_251_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_255_begin_0 = const()[name = tensor<string, []>("op_255_begin_0"), val = tensor<int32, [4]>([0, 200, 0, 0])];
            tensor<int32, [4]> var_255_end_0 = const()[name = tensor<string, []>("op_255_end_0"), val = tensor<int32, [4]>([2, 240, 1, 4096])];
            tensor<bool, [4]> var_255_end_mask_0 = const()[name = tensor<string, []>("op_255_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_255_cast = slice_by_index(begin = var_255_begin_0, end = var_255_end_0, end_mask = var_255_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [4]>([0, 240, 0, 0])];
            tensor<int32, [4]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [4]>([2, 280, 1, 4096])];
            tensor<bool, [4]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_259_cast = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> var_263_begin_0 = const()[name = tensor<string, []>("op_263_begin_0"), val = tensor<int32, [4]>([0, 280, 0, 0])];
            tensor<int32, [4]> var_263_end_0 = const()[name = tensor<string, []>("op_263_end_0"), val = tensor<int32, [4]>([2, 320, 1, 4096])];
            tensor<bool, [4]> var_263_end_mask_0 = const()[name = tensor<string, []>("op_263_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_263_cast = slice_by_index(begin = var_263_begin_0, end = var_263_end_0, end_mask = var_263_end_mask_0, x = q_1_cast);
            tensor<int32, [4]> k_3_perm_0 = const()[name = tensor<string, []>("k_3_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [4]> var_270_begin_0 = const()[name = tensor<string, []>("op_270_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_270_end_0 = const()[name = tensor<string, []>("op_270_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 40])];
            tensor<bool, [4]> var_270_end_mask_0 = const()[name = tensor<string, []>("op_270_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 320]> transpose_77 = transpose(perm = k_3_perm_0, x = k_1_cast);
            tensor<fp16, [2, 4096, 1, 40]> var_270_cast = slice_by_index(begin = var_270_begin_0, end = var_270_end_0, end_mask = var_270_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_274_begin_0 = const()[name = tensor<string, []>("op_274_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 40])];
            tensor<int32, [4]> var_274_end_0 = const()[name = tensor<string, []>("op_274_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 80])];
            tensor<bool, [4]> var_274_end_mask_0 = const()[name = tensor<string, []>("op_274_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_274_cast = slice_by_index(begin = var_274_begin_0, end = var_274_end_0, end_mask = var_274_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_278_begin_0 = const()[name = tensor<string, []>("op_278_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 80])];
            tensor<int32, [4]> var_278_end_0 = const()[name = tensor<string, []>("op_278_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 120])];
            tensor<bool, [4]> var_278_end_mask_0 = const()[name = tensor<string, []>("op_278_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_278_cast = slice_by_index(begin = var_278_begin_0, end = var_278_end_0, end_mask = var_278_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_282_begin_0 = const()[name = tensor<string, []>("op_282_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 120])];
            tensor<int32, [4]> var_282_end_0 = const()[name = tensor<string, []>("op_282_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 160])];
            tensor<bool, [4]> var_282_end_mask_0 = const()[name = tensor<string, []>("op_282_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_282_cast = slice_by_index(begin = var_282_begin_0, end = var_282_end_0, end_mask = var_282_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_286_begin_0 = const()[name = tensor<string, []>("op_286_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 160])];
            tensor<int32, [4]> var_286_end_0 = const()[name = tensor<string, []>("op_286_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 200])];
            tensor<bool, [4]> var_286_end_mask_0 = const()[name = tensor<string, []>("op_286_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_286_cast = slice_by_index(begin = var_286_begin_0, end = var_286_end_0, end_mask = var_286_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_290_begin_0 = const()[name = tensor<string, []>("op_290_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 200])];
            tensor<int32, [4]> var_290_end_0 = const()[name = tensor<string, []>("op_290_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 240])];
            tensor<bool, [4]> var_290_end_mask_0 = const()[name = tensor<string, []>("op_290_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_290_cast = slice_by_index(begin = var_290_begin_0, end = var_290_end_0, end_mask = var_290_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_294_begin_0 = const()[name = tensor<string, []>("op_294_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 240])];
            tensor<int32, [4]> var_294_end_0 = const()[name = tensor<string, []>("op_294_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 280])];
            tensor<bool, [4]> var_294_end_mask_0 = const()[name = tensor<string, []>("op_294_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_294_cast = slice_by_index(begin = var_294_begin_0, end = var_294_end_0, end_mask = var_294_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_298_begin_0 = const()[name = tensor<string, []>("op_298_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 280])];
            tensor<int32, [4]> var_298_end_0 = const()[name = tensor<string, []>("op_298_end_0"), val = tensor<int32, [4]>([2, 4096, 1, 320])];
            tensor<bool, [4]> var_298_end_mask_0 = const()[name = tensor<string, []>("op_298_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 4096, 1, 40]> var_298_cast = slice_by_index(begin = var_298_begin_0, end = var_298_end_0, end_mask = var_298_end_mask_0, x = transpose_77);
            tensor<int32, [4]> var_300_begin_0 = const()[name = tensor<string, []>("op_300_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_300_end_0 = const()[name = tensor<string, []>("op_300_end_0"), val = tensor<int32, [4]>([2, 40, 1, 4096])];
            tensor<bool, [4]> var_300_end_mask_0 = const()[name = tensor<string, []>("op_300_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_300_cast = slice_by_index(begin = var_300_begin_0, end = var_300_end_0, end_mask = var_300_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_304_begin_0 = const()[name = tensor<string, []>("op_304_begin_0"), val = tensor<int32, [4]>([0, 40, 0, 0])];
            tensor<int32, [4]> var_304_end_0 = const()[name = tensor<string, []>("op_304_end_0"), val = tensor<int32, [4]>([2, 80, 1, 4096])];
            tensor<bool, [4]> var_304_end_mask_0 = const()[name = tensor<string, []>("op_304_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_304_cast = slice_by_index(begin = var_304_begin_0, end = var_304_end_0, end_mask = var_304_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_308_begin_0 = const()[name = tensor<string, []>("op_308_begin_0"), val = tensor<int32, [4]>([0, 80, 0, 0])];
            tensor<int32, [4]> var_308_end_0 = const()[name = tensor<string, []>("op_308_end_0"), val = tensor<int32, [4]>([2, 120, 1, 4096])];
            tensor<bool, [4]> var_308_end_mask_0 = const()[name = tensor<string, []>("op_308_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_308_cast = slice_by_index(begin = var_308_begin_0, end = var_308_end_0, end_mask = var_308_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_312_begin_0 = const()[name = tensor<string, []>("op_312_begin_0"), val = tensor<int32, [4]>([0, 120, 0, 0])];
            tensor<int32, [4]> var_312_end_0 = const()[name = tensor<string, []>("op_312_end_0"), val = tensor<int32, [4]>([2, 160, 1, 4096])];
            tensor<bool, [4]> var_312_end_mask_0 = const()[name = tensor<string, []>("op_312_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_312_cast = slice_by_index(begin = var_312_begin_0, end = var_312_end_0, end_mask = var_312_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_316_begin_0 = const()[name = tensor<string, []>("op_316_begin_0"), val = tensor<int32, [4]>([0, 160, 0, 0])];
            tensor<int32, [4]> var_316_end_0 = const()[name = tensor<string, []>("op_316_end_0"), val = tensor<int32, [4]>([2, 200, 1, 4096])];
            tensor<bool, [4]> var_316_end_mask_0 = const()[name = tensor<string, []>("op_316_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_316_cast = slice_by_index(begin = var_316_begin_0, end = var_316_end_0, end_mask = var_316_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_320_begin_0 = const()[name = tensor<string, []>("op_320_begin_0"), val = tensor<int32, [4]>([0, 200, 0, 0])];
            tensor<int32, [4]> var_320_end_0 = const()[name = tensor<string, []>("op_320_end_0"), val = tensor<int32, [4]>([2, 240, 1, 4096])];
            tensor<bool, [4]> var_320_end_mask_0 = const()[name = tensor<string, []>("op_320_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_320_cast = slice_by_index(begin = var_320_begin_0, end = var_320_end_0, end_mask = var_320_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_324_begin_0 = const()[name = tensor<string, []>("op_324_begin_0"), val = tensor<int32, [4]>([0, 240, 0, 0])];
            tensor<int32, [4]> var_324_end_0 = const()[name = tensor<string, []>("op_324_end_0"), val = tensor<int32, [4]>([2, 280, 1, 4096])];
            tensor<bool, [4]> var_324_end_mask_0 = const()[name = tensor<string, []>("op_324_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_324_cast = slice_by_index(begin = var_324_begin_0, end = var_324_end_0, end_mask = var_324_end_mask_0, x = v_1_cast);
            tensor<int32, [4]> var_328_begin_0 = const()[name = tensor<string, []>("op_328_begin_0"), val = tensor<int32, [4]>([0, 280, 0, 0])];
            tensor<int32, [4]> var_328_end_0 = const()[name = tensor<string, []>("op_328_end_0"), val = tensor<int32, [4]>([2, 320, 1, 4096])];
            tensor<bool, [4]> var_328_end_mask_0 = const()[name = tensor<string, []>("op_328_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 40, 1, 4096]> var_328_cast = slice_by_index(begin = var_328_begin_0, end = var_328_end_0, end_mask = var_328_end_mask_0, x = v_1_cast);
            tensor<string, []> var_332_equation_0 = const()[name = tensor<string, []>("op_332_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_332_cast = einsum(equation = var_332_equation_0, values = (var_270_cast, var_235_cast));
            tensor<fp16, []> var_333_to_fp16 = const()[name = tensor<string, []>("op_333_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_1_cast = mul(x = var_332_cast, y = var_333_to_fp16);
            tensor<string, []> var_336_equation_0 = const()[name = tensor<string, []>("op_336_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_336_cast = einsum(equation = var_336_equation_0, values = (var_274_cast, var_239_cast));
            tensor<fp16, []> var_337_to_fp16 = const()[name = tensor<string, []>("op_337_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_3_cast = mul(x = var_336_cast, y = var_337_to_fp16);
            tensor<string, []> var_340_equation_0 = const()[name = tensor<string, []>("op_340_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_340_cast = einsum(equation = var_340_equation_0, values = (var_278_cast, var_243_cast));
            tensor<fp16, []> var_341_to_fp16 = const()[name = tensor<string, []>("op_341_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_5_cast = mul(x = var_340_cast, y = var_341_to_fp16);
            tensor<string, []> var_344_equation_0 = const()[name = tensor<string, []>("op_344_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_344_cast = einsum(equation = var_344_equation_0, values = (var_282_cast, var_247_cast));
            tensor<fp16, []> var_345_to_fp16 = const()[name = tensor<string, []>("op_345_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_7_cast = mul(x = var_344_cast, y = var_345_to_fp16);
            tensor<string, []> var_348_equation_0 = const()[name = tensor<string, []>("op_348_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_348_cast = einsum(equation = var_348_equation_0, values = (var_286_cast, var_251_cast));
            tensor<fp16, []> var_349_to_fp16 = const()[name = tensor<string, []>("op_349_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_9_cast = mul(x = var_348_cast, y = var_349_to_fp16);
            tensor<string, []> var_352_equation_0 = const()[name = tensor<string, []>("op_352_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_352_cast = einsum(equation = var_352_equation_0, values = (var_290_cast, var_255_cast));
            tensor<fp16, []> var_353_to_fp16 = const()[name = tensor<string, []>("op_353_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_11_cast = mul(x = var_352_cast, y = var_353_to_fp16);
            tensor<string, []> var_356_equation_0 = const()[name = tensor<string, []>("op_356_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_356_cast = einsum(equation = var_356_equation_0, values = (var_294_cast, var_259_cast));
            tensor<fp16, []> var_357_to_fp16 = const()[name = tensor<string, []>("op_357_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_13_cast = mul(x = var_356_cast, y = var_357_to_fp16);
            tensor<string, []> var_360_equation_0 = const()[name = tensor<string, []>("op_360_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [2, 4096, 1, 4096]> var_360_cast = einsum(equation = var_360_equation_0, values = (var_298_cast, var_263_cast));
            tensor<fp16, []> var_361_to_fp16 = const()[name = tensor<string, []>("op_361_to_fp16"), val = tensor<fp16, []>(0x1.43cp-3)];
            tensor<fp16, [2, 4096, 1, 4096]> aw_15_cast = mul(x = var_360_cast, y = var_361_to_fp16);
