program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1429.0.0"}})]
{
    func main<ios16>(tensor<fp16, [2, 768, 1, 77]> encoder_hidden_states, tensor<fp32, [2, 1280, 8, 8]> hidden_states_149_cast, tensor<fp32, [2, 640, 32, 32]> input_115_cast, tensor<fp32, [2, 640, 16, 16]> input_117_cast, tensor<fp32, [2, 1280, 16, 16]> input_143_cast, tensor<fp32, [2, 1280, 1, 1]> input_15_cast, tensor<fp32, [2, 1280, 16, 16]> input_169_cast, tensor<fp32, [2, 1280, 8, 8]> input_171_cast, tensor<fp32, [2, 2560, 8, 8]> input_253_cast, tensor<fp32, [2, 320, 64, 64]> input_35_cast, tensor<fp32, [2, 320, 64, 64]> input_61_cast, tensor<fp32, [2, 320, 32, 32]> input_63_cast, tensor<fp32, [2, 320, 64, 64]> input_7_cast, tensor<fp32, [2, 640, 32, 32]> input_89_cast) {
            tensor<string, []> cast_13_dtype_0 = const()[name = tensor<string, []>("cast_13_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_2_dtype_0 = const()[name = tensor<string, []>("cast_2_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_12_dtype_0 = const()[name = tensor<string, []>("cast_12_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_3_dtype_0 = const()[name = tensor<string, []>("cast_3_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_6_dtype_0 = const()[name = tensor<string, []>("cast_6_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_8_dtype_0 = const()[name = tensor<string, []>("cast_8_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_4_dtype_0 = const()[name = tensor<string, []>("cast_4_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_9_dtype_0 = const()[name = tensor<string, []>("cast_9_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_14_dtype_0 = const()[name = tensor<string, []>("cast_14_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_7_dtype_0 = const()[name = tensor<string, []>("cast_7_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_10_dtype_0 = const()[name = tensor<string, []>("cast_10_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<int32, []> var_4090 = const()[name = tensor<string, []>("op_4090"), val = tensor<int32, []>(1)];
            tensor<string, []> cast_11_dtype_0 = const()[name = tensor<string, []>("cast_11_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> cast_5_dtype_0 = const()[name = tensor<string, []>("cast_5_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<int32, [2]> var_4187 = const()[name = tensor<string, []>("op_4187"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4189 = const()[name = tensor<string, []>("op_4189"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_7_pad_type_0 = const()[name = tensor<string, []>("x_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_7_pad_0 = const()[name = tensor<string, []>("x_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 2560, 1, 1]> up_blocks_0_resnets_1_conv_shortcut_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_1_conv_shortcut_weight_to_fp16"), val = tensor<fp16, [1280, 2560, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1280]> up_blocks_0_resnets_1_conv_shortcut_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_1_conv_shortcut_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6553728)))];
            tensor<fp16, [2, 2560, 8, 8]> cast_2 = cast(dtype = cast_11_dtype_0, x = input_253_cast);
            tensor<fp16, [2, 1280, 8, 8]> x_7_cast = conv(bias = up_blocks_0_resnets_1_conv_shortcut_bias_to_fp16, dilations = var_4189, groups = var_4090, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = var_4187, weight = up_blocks_0_resnets_1_conv_shortcut_weight_to_fp16, x = cast_2);
            tensor<fp16, [2, 1280, 8, 8]> cast_1 = cast(dtype = cast_5_dtype_0, x = hidden_states_149_cast);
            tensor<fp16, [2, 1280, 8, 8]> hidden_states_151_cast = add(x = x_7_cast, y = cast_1);
            tensor<bool, []> input_267_interleave_0 = const()[name = tensor<string, []>("input_267_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 1280, 8, 8]> cast_3 = cast(dtype = cast_10_dtype_0, x = input_171_cast);
            tensor<fp16, [2, 2560, 8, 8]> input_267_cast = concat(axis = var_4090, interleave = input_267_interleave_0, values = (hidden_states_151_cast, cast_3));
            tensor<int32, [5]> reshape_124_shape_0 = const()[name = tensor<string, []>("reshape_124_shape_0"), val = tensor<int32, [5]>([2, 32, 80, 8, 8])];
            tensor<fp16, [2, 32, 80, 8, 8]> reshape_124_cast = reshape(shape = reshape_124_shape_0, x = input_267_cast);
            tensor<int32, [3]> reduce_mean_93_axes_0 = const()[name = tensor<string, []>("reduce_mean_93_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_93_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_93_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_93_cast = reduce_mean(axes = reduce_mean_93_axes_0, keep_dims = reduce_mean_93_keep_dims_0, x = reshape_124_cast);
            tensor<fp16, [2, 32, 80, 8, 8]> sub_62_cast = sub(x = reshape_124_cast, y = reduce_mean_93_cast);
            tensor<fp16, [2, 32, 80, 8, 8]> square_31_cast = square(x = sub_62_cast);
            tensor<int32, [3]> reduce_mean_95_axes_0 = const()[name = tensor<string, []>("reduce_mean_95_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_95_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_95_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_95_cast = reduce_mean(axes = reduce_mean_95_axes_0, keep_dims = reduce_mean_95_keep_dims_0, x = square_31_cast);
            tensor<fp16, []> add_62_y_0_to_fp16 = const()[name = tensor<string, []>("add_62_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_62_cast = add(x = reduce_mean_95_cast, y = add_62_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_31_cast = sqrt(x = add_62_cast);
            tensor<fp16, [2, 32, 80, 8, 8]> real_div_31_cast = real_div(x = sub_62_cast, y = sqrt_31_cast);
            tensor<int32, [4]> reshape_125_shape_0 = const()[name = tensor<string, []>("reshape_125_shape_0"), val = tensor<int32, [4]>([2, 2560, 8, 8])];
            tensor<fp16, [2, 2560, 8, 8]> reshape_125_cast = reshape(shape = reshape_125_shape_0, x = real_div_31_cast);
            tensor<fp16, [2560]> add_63_mean_0_to_fp16 = const()[name = tensor<string, []>("add_63_mean_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6556352)))];
            tensor<fp16, [2560]> add_63_variance_0_to_fp16 = const()[name = tensor<string, []>("add_63_variance_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6561536)))];
            tensor<fp16, [2560]> add_63_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_63_gamma_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6566720)))];
            tensor<fp16, [2560]> add_63_beta_0_to_fp16 = const()[name = tensor<string, []>("add_63_beta_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6571904)))];
            tensor<fp16, []> add_63_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_63_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 2560, 8, 8]> add_63_cast = batch_norm(beta = add_63_beta_0_to_fp16, epsilon = add_63_epsilon_0_to_fp16, gamma = add_63_gamma_0_to_fp16, mean = add_63_mean_0_to_fp16, variance = add_63_variance_0_to_fp16, x = reshape_125_cast);
            tensor<fp16, [2, 2560, 8, 8]> input_271_cast = silu(x = add_63_cast);
            tensor<int32, [2]> var_4207 = const()[name = tensor<string, []>("op_4207"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4209 = const()[name = tensor<string, []>("op_4209"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_153_pad_type_0 = const()[name = tensor<string, []>("hidden_states_153_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_153_pad_0 = const()[name = tensor<string, []>("hidden_states_153_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [1280, 2560, 3, 3]> up_blocks_0_resnets_2_conv1_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_conv1_weight_to_fp16"), val = tensor<fp16, [1280, 2560, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6577088)))];
            tensor<fp16, [1280]> up_blocks_0_resnets_2_conv1_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_conv1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65559552)))];
            tensor<fp16, [2, 1280, 8, 8]> hidden_states_153_cast = conv(bias = up_blocks_0_resnets_2_conv1_bias_to_fp16, dilations = var_4209, groups = var_4090, pad = hidden_states_153_pad_0, pad_type = hidden_states_153_pad_type_0, strides = var_4207, weight = up_blocks_0_resnets_2_conv1_weight_to_fp16, x = input_271_cast);
            tensor<int32, [2]> var_4215 = const()[name = tensor<string, []>("op_4215"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4217 = const()[name = tensor<string, []>("op_4217"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_25_pad_type_0 = const()[name = tensor<string, []>("temb_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_25_pad_0 = const()[name = tensor<string, []>("temb_25_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> up_blocks_0_resnets_2_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65562176)))];
            tensor<fp16, [1280]> up_blocks_0_resnets_2_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68839040)))];
            tensor<fp16, [2, 1280, 1, 1]> cast_12 = cast(dtype = cast_2_dtype_0, x = input_15_cast);
            tensor<fp16, [2, 1280, 1, 1]> temb_25_cast = conv(bias = up_blocks_0_resnets_2_time_emb_proj_bias_to_fp16, dilations = var_4217, groups = var_4090, pad = temb_25_pad_0, pad_type = temb_25_pad_type_0, strides = var_4215, weight = up_blocks_0_resnets_2_time_emb_proj_weight_to_fp16, x = cast_12);
            tensor<fp16, [2, 1280, 8, 8]> input_275_cast = add(x = hidden_states_153_cast, y = temb_25_cast);
            tensor<int32, [5]> reshape_128_shape_0 = const()[name = tensor<string, []>("reshape_128_shape_0"), val = tensor<int32, [5]>([2, 32, 40, 8, 8])];
            tensor<fp16, [2, 32, 40, 8, 8]> reshape_128_cast = reshape(shape = reshape_128_shape_0, x = input_275_cast);
            tensor<int32, [3]> reduce_mean_96_axes_0 = const()[name = tensor<string, []>("reduce_mean_96_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_96_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_96_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_96_cast = reduce_mean(axes = reduce_mean_96_axes_0, keep_dims = reduce_mean_96_keep_dims_0, x = reshape_128_cast);
            tensor<fp16, [2, 32, 40, 8, 8]> sub_64_cast = sub(x = reshape_128_cast, y = reduce_mean_96_cast);
            tensor<fp16, [2, 32, 40, 8, 8]> square_32_cast = square(x = sub_64_cast);
            tensor<int32, [3]> reduce_mean_98_axes_0 = const()[name = tensor<string, []>("reduce_mean_98_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_98_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_98_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_98_cast = reduce_mean(axes = reduce_mean_98_axes_0, keep_dims = reduce_mean_98_keep_dims_0, x = square_32_cast);
            tensor<fp16, []> add_64_y_0_to_fp16 = const()[name = tensor<string, []>("add_64_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_64_cast = add(x = reduce_mean_98_cast, y = add_64_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_32_cast = sqrt(x = add_64_cast);
            tensor<fp16, [2, 32, 40, 8, 8]> real_div_32_cast = real_div(x = sub_64_cast, y = sqrt_32_cast);
            tensor<int32, [4]> reshape_129_shape_0 = const()[name = tensor<string, []>("reshape_129_shape_0"), val = tensor<int32, [4]>([2, 1280, 8, 8])];
            tensor<fp16, [2, 1280, 8, 8]> reshape_129_cast = reshape(shape = reshape_129_shape_0, x = real_div_32_cast);
            tensor<fp16, [1280]> add_65_mean_0_to_fp16 = const()[name = tensor<string, []>("add_65_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68841664)))];
            tensor<fp16, [1280]> add_65_variance_0_to_fp16 = const()[name = tensor<string, []>("add_65_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68844288)))];
            tensor<fp16, [1280]> add_65_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_65_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68846912)))];
            tensor<fp16, [1280]> add_65_beta_0_to_fp16 = const()[name = tensor<string, []>("add_65_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68849536)))];
            tensor<fp16, []> add_65_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_65_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1280, 8, 8]> add_65_cast = batch_norm(beta = add_65_beta_0_to_fp16, epsilon = add_65_epsilon_0_to_fp16, gamma = add_65_gamma_0_to_fp16, mean = add_65_mean_0_to_fp16, variance = add_65_variance_0_to_fp16, x = reshape_129_cast);
            tensor<fp16, [2, 1280, 8, 8]> input_279_cast = silu(x = add_65_cast);
            tensor<int32, [2]> var_4227 = const()[name = tensor<string, []>("op_4227"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4229 = const()[name = tensor<string, []>("op_4229"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_155_pad_type_0 = const()[name = tensor<string, []>("hidden_states_155_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_155_pad_0 = const()[name = tensor<string, []>("hidden_states_155_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [1280, 1280, 3, 3]> up_blocks_0_resnets_2_conv2_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_conv2_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68852160)))];
            tensor<fp16, [1280]> up_blocks_0_resnets_2_conv2_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_conv2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(98343424)))];
            tensor<fp16, [2, 1280, 8, 8]> hidden_states_155_cast = conv(bias = up_blocks_0_resnets_2_conv2_bias_to_fp16, dilations = var_4229, groups = var_4090, pad = hidden_states_155_pad_0, pad_type = hidden_states_155_pad_type_0, strides = var_4227, weight = up_blocks_0_resnets_2_conv2_weight_to_fp16, x = input_279_cast);
            tensor<int32, [2]> var_4234 = const()[name = tensor<string, []>("op_4234"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4236 = const()[name = tensor<string, []>("op_4236"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_9_pad_type_0 = const()[name = tensor<string, []>("x_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_9_pad_0 = const()[name = tensor<string, []>("x_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 2560, 1, 1]> up_blocks_0_resnets_2_conv_shortcut_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_conv_shortcut_weight_to_fp16"), val = tensor<fp16, [1280, 2560, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(98346048)))];
            tensor<fp16, [1280]> up_blocks_0_resnets_2_conv_shortcut_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_resnets_2_conv_shortcut_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104899712)))];
            tensor<fp16, [2, 1280, 8, 8]> x_9_cast = conv(bias = up_blocks_0_resnets_2_conv_shortcut_bias_to_fp16, dilations = var_4236, groups = var_4090, pad = x_9_pad_0, pad_type = x_9_pad_type_0, strides = var_4234, weight = up_blocks_0_resnets_2_conv_shortcut_weight_to_fp16, x = input_267_cast);
            tensor<fp16, [2, 1280, 8, 8]> input_281_cast = add(x = x_9_cast, y = hidden_states_155_cast);
            tensor<fp32, []> input_283_scale_factor_height_0 = const()[name = tensor<string, []>("input_283_scale_factor_height_0"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp32, []> input_283_scale_factor_width_0 = const()[name = tensor<string, []>("input_283_scale_factor_width_0"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp16, [2, 1280, 16, 16]> input_283_cast = upsample_nearest_neighbor(scale_factor_height = input_283_scale_factor_height_0, scale_factor_width = input_283_scale_factor_width_0, x = input_281_cast);
            tensor<int32, [2]> var_4245 = const()[name = tensor<string, []>("op_4245"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4247 = const()[name = tensor<string, []>("op_4247"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_157_pad_type_0 = const()[name = tensor<string, []>("hidden_states_157_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_157_pad_0 = const()[name = tensor<string, []>("hidden_states_157_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [1280, 1280, 3, 3]> up_blocks_0_upsamplers_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_upsamplers_0_conv_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104902336)))];
            tensor<fp16, [1280]> up_blocks_0_upsamplers_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_0_upsamplers_0_conv_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134393600)))];
            tensor<fp16, [2, 1280, 16, 16]> hidden_states_157_cast = conv(bias = up_blocks_0_upsamplers_0_conv_bias_to_fp16, dilations = var_4247, groups = var_4090, pad = hidden_states_157_pad_0, pad_type = hidden_states_157_pad_type_0, strides = var_4245, weight = up_blocks_0_upsamplers_0_conv_weight_to_fp16, x = input_283_cast);
            tensor<bool, []> var_4267 = const()[name = tensor<string, []>("op_4267"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_4272 = const()[name = tensor<string, []>("op_4272"), val = tensor<int32, []>(1)];
            tensor<bool, []> input_285_interleave_0 = const()[name = tensor<string, []>("input_285_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 1280, 16, 16]> cast_4 = cast(dtype = cast_7_dtype_0, x = input_169_cast);
            tensor<fp16, [2, 2560, 16, 16]> input_285_cast = concat(axis = var_4272, interleave = input_285_interleave_0, values = (hidden_states_157_cast, cast_4));
            tensor<int32, [5]> reshape_132_shape_0 = const()[name = tensor<string, []>("reshape_132_shape_0"), val = tensor<int32, [5]>([2, 32, 80, 16, 16])];
            tensor<fp16, [2, 32, 80, 16, 16]> reshape_132_cast = reshape(shape = reshape_132_shape_0, x = input_285_cast);
            tensor<int32, [3]> reduce_mean_99_axes_0 = const()[name = tensor<string, []>("reduce_mean_99_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_99_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_99_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_99_cast = reduce_mean(axes = reduce_mean_99_axes_0, keep_dims = reduce_mean_99_keep_dims_0, x = reshape_132_cast);
            tensor<fp16, [2, 32, 80, 16, 16]> sub_66_cast = sub(x = reshape_132_cast, y = reduce_mean_99_cast);
            tensor<fp16, [2, 32, 80, 16, 16]> square_33_cast = square(x = sub_66_cast);
            tensor<int32, [3]> reduce_mean_101_axes_0 = const()[name = tensor<string, []>("reduce_mean_101_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_101_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_101_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_101_cast = reduce_mean(axes = reduce_mean_101_axes_0, keep_dims = reduce_mean_101_keep_dims_0, x = square_33_cast);
            tensor<fp16, []> add_66_y_0_to_fp16 = const()[name = tensor<string, []>("add_66_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_66_cast = add(x = reduce_mean_101_cast, y = add_66_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_33_cast = sqrt(x = add_66_cast);
            tensor<fp16, [2, 32, 80, 16, 16]> real_div_33_cast = real_div(x = sub_66_cast, y = sqrt_33_cast);
            tensor<int32, [4]> reshape_133_shape_0 = const()[name = tensor<string, []>("reshape_133_shape_0"), val = tensor<int32, [4]>([2, 2560, 16, 16])];
            tensor<fp16, [2, 2560, 16, 16]> reshape_133_cast = reshape(shape = reshape_133_shape_0, x = real_div_33_cast);
            tensor<fp16, [2560]> add_67_mean_0_to_fp16 = const()[name = tensor<string, []>("add_67_mean_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134396224)))];
            tensor<fp16, [2560]> add_67_variance_0_to_fp16 = const()[name = tensor<string, []>("add_67_variance_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134401408)))];
            tensor<fp16, [2560]> add_67_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_67_gamma_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134406592)))];
            tensor<fp16, [2560]> add_67_beta_0_to_fp16 = const()[name = tensor<string, []>("add_67_beta_0_to_fp16"), val = tensor<fp16, [2560]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134411776)))];
            tensor<fp16, []> add_67_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_67_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 2560, 16, 16]> add_67_cast = batch_norm(beta = add_67_beta_0_to_fp16, epsilon = add_67_epsilon_0_to_fp16, gamma = add_67_gamma_0_to_fp16, mean = add_67_mean_0_to_fp16, variance = add_67_variance_0_to_fp16, x = reshape_133_cast);
            tensor<fp16, [2, 2560, 16, 16]> input_289_cast = silu(x = add_67_cast);
            tensor<int32, [2]> var_4301 = const()[name = tensor<string, []>("op_4301"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4303 = const()[name = tensor<string, []>("op_4303"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_159_pad_type_0 = const()[name = tensor<string, []>("hidden_states_159_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_159_pad_0 = const()[name = tensor<string, []>("hidden_states_159_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [1280, 2560, 3, 3]> up_blocks_1_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [1280, 2560, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134416960)))];
            tensor<fp16, [1280]> up_blocks_1_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193399424)))];
            tensor<fp16, [2, 1280, 16, 16]> hidden_states_159_cast = conv(bias = up_blocks_1_resnets_0_conv1_bias_to_fp16, dilations = var_4303, groups = var_4272, pad = hidden_states_159_pad_0, pad_type = hidden_states_159_pad_type_0, strides = var_4301, weight = up_blocks_1_resnets_0_conv1_weight_to_fp16, x = input_289_cast);
            tensor<int32, [2]> var_4309 = const()[name = tensor<string, []>("op_4309"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4311 = const()[name = tensor<string, []>("op_4311"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_27_pad_type_0 = const()[name = tensor<string, []>("temb_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_27_pad_0 = const()[name = tensor<string, []>("temb_27_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> up_blocks_1_resnets_0_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193402048)))];
            tensor<fp16, [1280]> up_blocks_1_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196678912)))];
            tensor<fp16, [2, 1280, 1, 1]> temb_27_cast = conv(bias = up_blocks_1_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_4311, groups = var_4272, pad = temb_27_pad_0, pad_type = temb_27_pad_type_0, strides = var_4309, weight = up_blocks_1_resnets_0_time_emb_proj_weight_to_fp16, x = cast_12);
            tensor<fp16, [2, 1280, 16, 16]> input_293_cast = add(x = hidden_states_159_cast, y = temb_27_cast);
            tensor<int32, [5]> reshape_136_shape_0 = const()[name = tensor<string, []>("reshape_136_shape_0"), val = tensor<int32, [5]>([2, 32, 40, 16, 16])];
            tensor<fp16, [2, 32, 40, 16, 16]> reshape_136_cast = reshape(shape = reshape_136_shape_0, x = input_293_cast);
            tensor<int32, [3]> reduce_mean_102_axes_0 = const()[name = tensor<string, []>("reduce_mean_102_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_102_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_102_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_102_cast = reduce_mean(axes = reduce_mean_102_axes_0, keep_dims = reduce_mean_102_keep_dims_0, x = reshape_136_cast);
            tensor<fp16, [2, 32, 40, 16, 16]> sub_68_cast = sub(x = reshape_136_cast, y = reduce_mean_102_cast);
            tensor<fp16, [2, 32, 40, 16, 16]> square_34_cast = square(x = sub_68_cast);
            tensor<int32, [3]> reduce_mean_104_axes_0 = const()[name = tensor<string, []>("reduce_mean_104_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_104_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_104_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_104_cast = reduce_mean(axes = reduce_mean_104_axes_0, keep_dims = reduce_mean_104_keep_dims_0, x = square_34_cast);
            tensor<fp16, []> add_68_y_0_to_fp16 = const()[name = tensor<string, []>("add_68_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_68_cast = add(x = reduce_mean_104_cast, y = add_68_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_34_cast = sqrt(x = add_68_cast);
            tensor<fp16, [2, 32, 40, 16, 16]> real_div_34_cast = real_div(x = sub_68_cast, y = sqrt_34_cast);
            tensor<int32, [4]> reshape_137_shape_0 = const()[name = tensor<string, []>("reshape_137_shape_0"), val = tensor<int32, [4]>([2, 1280, 16, 16])];
            tensor<fp16, [2, 1280, 16, 16]> reshape_137_cast = reshape(shape = reshape_137_shape_0, x = real_div_34_cast);
            tensor<fp16, [1280]> add_69_mean_0_to_fp16 = const()[name = tensor<string, []>("add_69_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196681536)))];
            tensor<fp16, [1280]> add_69_variance_0_to_fp16 = const()[name = tensor<string, []>("add_69_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196684160)))];
            tensor<fp16, [1280]> add_69_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_69_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196686784)))];
            tensor<fp16, [1280]> add_69_beta_0_to_fp16 = const()[name = tensor<string, []>("add_69_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196689408)))];
            tensor<fp16, []> add_69_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_69_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1280, 16, 16]> add_69_cast = batch_norm(beta = add_69_beta_0_to_fp16, epsilon = add_69_epsilon_0_to_fp16, gamma = add_69_gamma_0_to_fp16, mean = add_69_mean_0_to_fp16, variance = add_69_variance_0_to_fp16, x = reshape_137_cast);
            tensor<fp16, [2, 1280, 16, 16]> input_297_cast = silu(x = add_69_cast);
            tensor<int32, [2]> var_4321 = const()[name = tensor<string, []>("op_4321"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4323 = const()[name = tensor<string, []>("op_4323"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_161_pad_type_0 = const()[name = tensor<string, []>("hidden_states_161_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_161_pad_0 = const()[name = tensor<string, []>("hidden_states_161_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [1280, 1280, 3, 3]> up_blocks_1_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196692032)))];
            tensor<fp16, [1280]> up_blocks_1_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(226183296)))];
            tensor<fp16, [2, 1280, 16, 16]> hidden_states_161_cast = conv(bias = up_blocks_1_resnets_0_conv2_bias_to_fp16, dilations = var_4323, groups = var_4272, pad = hidden_states_161_pad_0, pad_type = hidden_states_161_pad_type_0, strides = var_4321, weight = up_blocks_1_resnets_0_conv2_weight_to_fp16, x = input_297_cast);
            tensor<int32, [2]> var_4328 = const()[name = tensor<string, []>("op_4328"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4330 = const()[name = tensor<string, []>("op_4330"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_11_pad_type_0 = const()[name = tensor<string, []>("x_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_11_pad_0 = const()[name = tensor<string, []>("x_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 2560, 1, 1]> up_blocks_1_resnets_0_conv_shortcut_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_conv_shortcut_weight_to_fp16"), val = tensor<fp16, [1280, 2560, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(226185920)))];
            tensor<fp16, [1280]> up_blocks_1_resnets_0_conv_shortcut_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_resnets_0_conv_shortcut_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(232739584)))];
            tensor<fp16, [2, 1280, 16, 16]> x_11_cast = conv(bias = up_blocks_1_resnets_0_conv_shortcut_bias_to_fp16, dilations = var_4330, groups = var_4272, pad = x_11_pad_0, pad_type = x_11_pad_type_0, strides = var_4328, weight = up_blocks_1_resnets_0_conv_shortcut_weight_to_fp16, x = input_285_cast);
            tensor<fp16, [2, 1280, 16, 16]> hidden_states_163_cast = add(x = x_11_cast, y = hidden_states_161_cast);
            tensor<int32, [5]> reshape_140_shape_0 = const()[name = tensor<string, []>("reshape_140_shape_0"), val = tensor<int32, [5]>([2, 32, 40, 16, 16])];
            tensor<fp16, [2, 32, 40, 16, 16]> reshape_140_cast = reshape(shape = reshape_140_shape_0, x = hidden_states_163_cast);
            tensor<int32, [3]> reduce_mean_105_axes_0 = const()[name = tensor<string, []>("reduce_mean_105_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_105_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_105_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_105_cast = reduce_mean(axes = reduce_mean_105_axes_0, keep_dims = reduce_mean_105_keep_dims_0, x = reshape_140_cast);
            tensor<fp16, [2, 32, 40, 16, 16]> sub_70_cast = sub(x = reshape_140_cast, y = reduce_mean_105_cast);
            tensor<fp16, [2, 32, 40, 16, 16]> square_35_cast = square(x = sub_70_cast);
            tensor<int32, [3]> reduce_mean_107_axes_0 = const()[name = tensor<string, []>("reduce_mean_107_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_107_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_107_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_107_cast = reduce_mean(axes = reduce_mean_107_axes_0, keep_dims = reduce_mean_107_keep_dims_0, x = square_35_cast);
            tensor<fp16, []> add_70_y_0_to_fp16 = const()[name = tensor<string, []>("add_70_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_70_cast = add(x = reduce_mean_107_cast, y = add_70_y_0_to_fp16);
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_35_cast = sqrt(x = add_70_cast);
            tensor<fp16, [2, 32, 40, 16, 16]> real_div_35_cast = real_div(x = sub_70_cast, y = sqrt_35_cast);
            tensor<int32, [4]> reshape_141_shape_0 = const()[name = tensor<string, []>("reshape_141_shape_0"), val = tensor<int32, [4]>([2, 1280, 16, 16])];
            tensor<fp16, [2, 1280, 16, 16]> reshape_141_cast = reshape(shape = reshape_141_shape_0, x = real_div_35_cast);
            tensor<fp16, [1280]> add_71_mean_0_to_fp16 = const()[name = tensor<string, []>("add_71_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(232742208)))];
            tensor<fp16, [1280]> add_71_variance_0_to_fp16 = const()[name = tensor<string, []>("add_71_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(232744832)))];
            tensor<fp16, [1280]> add_71_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_71_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(232747456)))];
            tensor<fp16, [1280]> add_71_beta_0_to_fp16 = const()[name = tensor<string, []>("add_71_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(232750080)))];
            tensor<fp16, []> add_71_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_71_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1280, 16, 16]> add_71_cast = batch_norm(beta = add_71_beta_0_to_fp16, epsilon = add_71_epsilon_0_to_fp16, gamma = add_71_gamma_0_to_fp16, mean = add_71_mean_0_to_fp16, variance = add_71_variance_0_to_fp16, x = reshape_141_cast);
            tensor<int32, [2]> var_4350 = const()[name = tensor<string, []>("op_4350"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4352 = const()[name = tensor<string, []>("op_4352"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_165_pad_type_0 = const()[name = tensor<string, []>("hidden_states_165_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_165_pad_0 = const()[name = tensor<string, []>("hidden_states_165_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> up_blocks_1_attentions_0_proj_in_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_attentions_0_proj_in_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(232752704)))];
            tensor<fp16, [1280]> up_blocks_1_attentions_0_proj_in_bias_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_attentions_0_proj_in_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(236029568)))];
            tensor<fp16, [2, 1280, 16, 16]> hidden_states_165_cast = conv(bias = up_blocks_1_attentions_0_proj_in_bias_to_fp16, dilations = var_4352, groups = var_4272, pad = hidden_states_165_pad_0, pad_type = hidden_states_165_pad_type_0, strides = var_4350, weight = up_blocks_1_attentions_0_proj_in_weight_to_fp16, x = add_71_cast);
            tensor<int32, [4]> var_4357 = const()[name = tensor<string, []>("op_4357"), val = tensor<int32, [4]>([2, 1280, 1, 256])];
            tensor<fp16, [2, 1280, 1, 256]> inputs_43_cast = reshape(shape = var_4357, x = hidden_states_165_cast);
            tensor<int32, [1]> var_4367 = const()[name = tensor<string, []>("op_4367"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 256]> channels_mean_43_cast = reduce_mean(axes = var_4367, keep_dims = var_4267, x = inputs_43_cast);
            tensor<fp16, [2, 1280, 1, 256]> zero_mean_43_cast = sub(x = inputs_43_cast, y = channels_mean_43_cast);
            tensor<fp16, [2, 1280, 1, 256]> zero_mean_sq_43_cast = mul(x = zero_mean_43_cast, y = zero_mean_43_cast);
            tensor<int32, [1]> var_4371 = const()[name = tensor<string, []>("op_4371"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 256]> var_4372_cast = reduce_mean(axes = var_4371, keep_dims = var_4267, x = zero_mean_sq_43_cast);
            tensor<fp16, []> var_4373_to_fp16 = const()[name = tensor<string, []>("op_4373_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1, 1, 256]> var_4374_cast = add(x = var_4372_cast, y = var_4373_to_fp16);
            tensor<fp16, []> denom_43_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_43_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [2, 1, 1, 256]> denom_43_cast = rsqrt(epsilon = denom_43_epsilon_0_to_fp16, x = var_4374_cast);
            tensor<fp16, [2, 1280, 1, 256]> out_43_cast = mul(x = zero_mean_43_cast, y = denom_43_cast);
            tensor<fp16, [1, 1280, 1, 1]> var_4378_to_fp16 = const()[name = tensor<string, []>("op_4378_to_fp16"), val = tensor<fp16, [1, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(236032192)))];
            tensor<fp16, [2, 1280, 1, 256]> var_4379_cast = add(x = out_43_cast, y = var_4378_to_fp16);
            tensor<fp16, [1, 1280, 1, 1]> var_4381_to_fp16 = const()[name = tensor<string, []>("op_4381_to_fp16"), val = tensor<fp16, [1, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(236034816)))];
            tensor<fp16, [2, 1280, 1, 256]> hidden_states_167_cast = mul(x = var_4379_cast, y = var_4381_to_fp16);
            tensor<int32, [2]> var_4388 = const()[name = tensor<string, []>("op_4388"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4390 = const()[name = tensor<string, []>("op_4390"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_29_pad_type_0 = const()[name = tensor<string, []>("q_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_29_pad_0 = const()[name = tensor<string, []>("q_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(236037440)))];
            tensor<fp16, [2, 1280, 1, 256]> q_29_cast = conv(dilations = var_4390, groups = var_4272, pad = q_29_pad_0, pad_type = q_29_pad_type_0, strides = var_4388, weight = up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16, x = hidden_states_167_cast);
            tensor<int32, [2]> var_4394 = const()[name = tensor<string, []>("op_4394"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4396 = const()[name = tensor<string, []>("op_4396"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_57_pad_type_0 = const()[name = tensor<string, []>("k_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_57_pad_0 = const()[name = tensor<string, []>("k_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(239314304)))];
            tensor<fp16, [2, 1280, 1, 256]> k_57_cast = conv(dilations = var_4396, groups = var_4272, pad = k_57_pad_0, pad_type = k_57_pad_type_0, strides = var_4394, weight = up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16, x = hidden_states_167_cast);
            tensor<int32, [2]> var_4400 = const()[name = tensor<string, []>("op_4400"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_4402 = const()[name = tensor<string, []>("op_4402"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_29_pad_type_0 = const()[name = tensor<string, []>("v_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_29_pad_0 = const()[name = tensor<string, []>("v_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16 = const()[name = tensor<string, []>("up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(242591168)))];
            tensor<fp16, [2, 1280, 1, 256]> v_29_cast = conv(dilations = var_4402, groups = var_4272, pad = v_29_pad_0, pad_type = v_29_pad_type_0, strides = var_4400, weight = up_blocks_1_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16, x = hidden_states_167_cast);
            tensor<int32, [4]> var_4406_begin_0 = const()[name = tensor<string, []>("op_4406_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_4406_end_0 = const()[name = tensor<string, []>("op_4406_end_0"), val = tensor<int32, [4]>([2, 160, 1, 256])];
            tensor<bool, [4]> var_4406_end_mask_0 = const()[name = tensor<string, []>("op_4406_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 160, 1, 256]> var_4406_cast = slice_by_index(begin = var_4406_begin_0, end = var_4406_end_0, end_mask = var_4406_end_mask_0, x = q_29_cast);
            tensor<int32, [4]> var_4410_begin_0 = const()[name = tensor<string, []>("op_4410_begin_0"), val = tensor<int32, [4]>([0, 160, 0, 0])];
            tensor<int32, [4]> var_4410_end_0 = const()[name = tensor<string, []>("op_4410_end_0"), val = tensor<int32, [4]>([2, 320, 1, 256])];
            tensor<bool, [4]> var_4410_end_mask_0 = const()[name = tensor<string, []>("op_4410_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 160, 1, 256]> var_4410_cast = slice_by_index(begin = var_4410_begin_0, end = var_4410_end_0, end_mask = var_4410_end_mask_0, x = q_29_cast);
            tensor<int32, [4]> var_4414_begin_0 = const()[name = tensor<string, []>("op_4414_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_4414_end_0 = const()[name = tensor<string, []>("op_4414_end_0"), val = tensor<int32, [4]>([2, 480, 1, 256])];
            tensor<bool, [4]> var_4414_end_mask_0 = const()[name = tensor<string, []>("op_4414_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 160, 1, 256]> var_4414_cast = slice_by_index(begin = var_4414_begin_0, end = var_4414_end_0, end_mask = var_4414_end_mask_0, x = q_29_cast);
            tensor<int32, [4]> var_4418_begin_0 = const()[name = tensor<string, []>("op_4418_begin_0"), val = tensor<int32, [4]>([0, 480, 0, 0])];
            tensor<int32, [4]> var_4418_end_0 = const()[name = tensor<string, []>("op_4418_end_0"), val = tensor<int32, [4]>([2, 640, 1, 256])];
            tensor<bool, [4]> var_4418_end_mask_0 = const()[name = tensor<string, []>("op_4418_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 160, 1, 256]> var_4418_cast = slice_by_index(begin = var_4418_begin_0, end = var_4418_end_0, end_mask = var_4418_end_mask_0, x = q_29_cast);
            tensor<int32, [4]> var_4422_begin_0 = const()[name = tensor<string, []>("op_4422_begin_0"), val = tensor<int32, [4]>([0, 640, 0, 0])];
            tensor<int32, [4]> var_4422_end_0 = const()[name = tensor<string, []>("op_4422_end_0"), val = tensor<int32, [4]>([2, 800, 1, 256])];
            tensor<bool, [4]> var_4422_end_mask_0 = const()[name = tensor<string, []>("op_4422_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 160, 1, 256]> var_4422_cast = slice_by_index(begin = var_4422_begin_0, end = var_4422_end_0, end_mask = var_4422_end_mask_0, x = q_29_cast);
            tensor<int32, [4]> var_4426_begin_0 = const()[name = tensor<string, []>("op_4426_begin_0"), val = tensor<int32, [4]>([0, 800, 0, 0])];
            tensor<int32, [4]> var_4426_end_0 = const()[name = tensor<string, []>("op_4426_end_0"), val = tensor<int32, [4]>([2, 960, 1, 256])];
            tensor<bool, [4]> var_4426_end_mask_0 = const()[name = tensor<string, []>("op_4426_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 160, 1, 256]> var_4426_cast = slice_by_index(begin = var_4426_begin_0, end = var_4426_end_0, end_mask = var_4426_end_mask_0, x = q_29_cast);
            tensor<int32, [4]> var_4430_begin_0 = const()[name = tensor<string, []>("op_4430_begin_0"), val = tensor<int32, [4]>([0, 960, 0, 0])];
